In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.12/dist-packages (4.0.1)
Requirement already satisfied: py4j==0.10.9.9 in /usr/local/lib/python3.12/dist-packages (from pyspark) (0.10.9.9)

In [2]:
data = [
("C001", "Arjun", "Hyderabad", 25, 45000, "Electronics"),
("C002", "Meera", "Chennai", 32, 52000, "Grocery"),
("C003", "Rajesh", "Bangalore", 29, 61000, "Clothing"),
("C004", "Priya", "Delhi", 22, 38000, "Grocery"),
("C005", "Sanjay", "Mumbai", 35, 72000, "Electronics"),
("C006", "Kavya", "Hyderabad", 28, 48000, "Grocery"),
("C007", "Imran", "Delhi", 31, 53000, "Clothing"),
("C008", "Divya", "Chennai", 27, 45000, "Electronics"),
("C009", "Anil", "Bangalore", 40, 85000, "Furniture"),
("C010", "Ritu", "Mumbai", 23, 39000, "Clothing"),
("C011", "Hari", "Hyderabad", 33, 56000, "Grocery"),
("C012", "Sana", "Delhi", 26, 47000, "Electronics"),
("C013", "Vikram", "Chennai", 38, 91000, "Furniture"),
("C014", "Deepa", "Mumbai", 30, 62000, "Clothing"),
("C015", "Asha", "Bangalore", 24, 41000, "Grocery"),
("C016", "Kiran", "Delhi", 29, 59000, "Furniture"),
("C017", "Farah", "Hyderabad", 36, 70000, "Clothing"),
("C018", "Tarun", "Chennai", 28, 53000, "Furniture"),
("C019", "Nisha", "Mumbai", 21, 35000, "Grocery"),
("C020", "Yusuf", "Bangalore", 34, 76000, "Electronics"),
("C021", "Pooja", "Delhi", 27, 47000, "Clothing"),
("C022", "Zara", "Hyderabad", 32, 58000, "Grocery"),
("C023", "Ajay", "Chennai", 30, 51000, "Furniture"),
("C024", "Reema", "Bangalore", 28, 49000, "Clothing"),
("C025", "Gautam", "Mumbai", 39, 82000, "Furniture"),
("C026", "Swati", "Delhi", 25, 46000, "Electronics"),
("C027", "Mahesh", "Hyderabad", 41, 90000, "Furniture"),
("C028", "Anita", "Chennai", 26, 44000, "Clothing"),
("C029", "Sameer", "Bangalore", 33, 68000, "Electronics"),
("C030", "Leela", "Delhi", 22, 36000, "Grocery")
]

In [3]:
columns = ["customer_id", "name", "city", "age", "annual_spend", "categories"]

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("CustomerData").getOrCreate()
df = spark.createDataFrame(data, columns)
df.show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
+-----------+------+---------+---+------------+-----------+
only showing top 20 rows

Exercise 1

Show the first 10 customers.

In [5]:
df.head(10)

[Row(customer_id='C001', name='Arjun', city='Hyderabad', age=25, annual_spend=45000, categories='Electronics'),
 Row(customer_id='C002', name='Meera', city='Chennai', age=32, annual_spend=52000, categories='Grocery'),
 Row(customer_id='C003', name='Rajesh', city='Bangalore', age=29, annual_spend=61000, categories='Clothing'),
 Row(customer_id='C004', name='Priya', city='Delhi', age=22, annual_spend=38000, categories='Grocery'),
 Row(customer_id='C005', name='Sanjay', city='Mumbai', age=35, annual_spend=72000, categories='Electronics'),
 Row(customer_id='C006', name='Kavya', city='Hyderabad', age=28, annual_spend=48000, categories='Grocery'),
 Row(customer_id='C007', name='Imran', city='Delhi', age=31, annual_spend=53000, categories='Clothing'),
 Row(customer_id='C008', name='Divya', city='Chennai', age=27, annual_spend=45000, categories='Electronics'),
 Row(customer_id='C009', name='Anil', city='Bangalore', age=40, annual_spend=85000, categories='Furniture'),
 Row(customer_id='C010', name='Ritu', city='Mumbai', age=23, annual_spend=39000, categories='Clothing')]

Exercise 2

List all unique cities. Hint: df.select("city").distinct()

In [6]:
print(df.select("city").distinct())

DataFrame[city: string]

In [7]:
df.select("city").distinct().show()

+---------+
|     city|
+---------+
|Bangalore|
|  Chennai|
|   Mumbai|
|    Delhi|
|Hyderabad|
+---------+


Exercise 3

Display only customer_id, name, and annual_spend columns.

In [8]:
df.select("customer_id", "name", "annual_spend").show()

+-----------+------+------------+
|customer_id|  name|annual_spend|
+-----------+------+------------+
|       C001| Arjun|       45000|
|       C002| Meera|       52000|
|       C003|Rajesh|       61000|
|       C004| Priya|       38000|
|       C005|Sanjay|       72000|
|       C006| Kavya|       48000|
|       C007| Imran|       53000|
|       C008| Divya|       45000|
|       C009|  Anil|       85000|
|       C010|  Ritu|       39000|
|       C011|  Hari|       56000|
|       C012|  Sana|       47000|
|       C013|Vikram|       91000|
|       C014| Deepa|       62000|
|       C015|  Asha|       41000|
|       C016| Kiran|       59000|
|       C017| Farah|       70000|
|       C018| Tarun|       53000|
|       C019| Nisha|       35000|
|       C020| Yusuf|       76000|
+-----------+------+------------+
only showing top 20 rows

Exercise 4

Filter all customers who spend more than 60000 annually.

In [9]:
df.filter(df.annual_spend > 60000).show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|
+-----------+------+---------+---+------------+-----------+

Exercise 5

Show all customers from Delhi who are younger than 30.

In [10]:
df.filter((df.city == 'Delhi') & (df.age < 30)).show()

+-----------+-----+-----+---+------------+-----------+
|customer_id| name| city|age|annual_spend| categories|
+-----------+-----+-----+---+------------+-----------+
|       C004|Priya|Delhi| 22|       38000|    Grocery|
|       C012| Sana|Delhi| 26|       47000|Electronics|
|       C016|Kiran|Delhi| 29|       59000|  Furniture|
|       C021|Pooja|Delhi| 27|       47000|   Clothing|
|       C026|Swati|Delhi| 25|       46000|Electronics|
|       C030|Leela|Delhi| 22|       36000|    Grocery|
+-----------+-----+-----+---+------------+-----------+

Exercise 6

Create a new column named "spend_lakh" = annual_spend / 100000.

In [12]:
from pyspark.sql.functions import col

df_with_spend_lakh = df.withColumn("spend_lakh", col("annual_spend") / 100000)
df_with_spend_lakh.show()

+-----------+------+---------+---+------------+-----------+----------+
|customer_id|  name|     city|age|annual_spend| categories|spend_lakh|
+-----------+------+---------+---+------------+-----------+----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|      0.45|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|      0.52|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|      0.61|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|      0.38|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      0.72|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|      0.48|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|      0.53|
|       C008| Divya|  Chennai| 27|       45000|Electronics|      0.45|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      0.85|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|      0.39|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|      0.56|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|      0.47|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      0.91|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|      0.62|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|      0.41|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|      0.59|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|       0.7|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|      0.53|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|      0.35|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      0.76|
+-----------+------+---------+---+------------+-----------+----------+
only showing top 20 rows

Exercise 7

Create a new column "customer_type" Logic: spend > 70000 → Premium else → Standard Use when() and otherwise().

In [13]:
from pyspark.sql.functions import when, col

df_with_customer_type = df.withColumn(
    "customer_type",
    when(col("annual_spend") > 70000, "Premium").otherwise("Standard")
)
df_with_customer_type.show()

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend| categories|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|     Standard|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      Premium|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     Standard|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|     Standard|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      Premium|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      Premium|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|     Standard|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     Standard|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|     Standard|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     Standard|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|     Standard|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|     Standard|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|
+-----------+------+---------+---+------------+-----------+-------------+
only showing top 20 rows

Exercise 8

Show customers whose name starts with the letter A.

In [14]:
from pyspark.sql.functions import col
df.filter(col("name").startswith("A")).show()

+-----------+-----+---------+---+------------+-----------+
|customer_id| name|     city|age|annual_spend| categories|
+-----------+-----+---------+---+------------+-----------+
|       C001|Arjun|Hyderabad| 25|       45000|Electronics|
|       C009| Anil|Bangalore| 40|       85000|  Furniture|
|       C015| Asha|Bangalore| 24|       41000|    Grocery|
|       C023| Ajay|  Chennai| 30|       51000|  Furniture|
|       C028|Anita|  Chennai| 26|       44000|   Clothing|
+-----------+-----+---------+---+------------+-----------+

Exercise 9

Filter customers where category is either Clothing or Electronics.

In [15]:
df.filter(df.categories.isin('Clothing', 'Electronics')).show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|
|       C026| Swati|    Delhi| 25|       46000|Electronics|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|
+-----------+------+---------+---+------------+-----------+


Exercise 10

Convert the city name to uppercase using the upper() function.

In [16]:
from pyspark.sql.functions import upper

df_upper_city = df.withColumn("city_uppercase", upper(df.city))
df_upper_city.show()

+-----------+------+---------+---+------------+-----------+--------------+
|customer_id|  name|     city|age|annual_spend| categories|city_uppercase|
+-----------+------+---------+---+------------+-----------+--------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     HYDERABAD|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|       CHENNAI|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     BANGALORE|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|         DELHI|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|        MUMBAI|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     HYDERABAD|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|         DELHI|
|       C008| Divya|  Chennai| 27|       45000|Electronics|       CHENNAI|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|     BANGALORE|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|        MUMBAI|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|     HYDERABAD|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|         DELHI|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|       CHENNAI|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|        MUMBAI|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     BANGALORE|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|         DELHI|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     HYDERABAD|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|       CHENNAI|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|        MUMBAI|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|     BANGALORE|
+-----------+------+---------+---+------------+-----------+--------------+
only showing top 20 rows

Exercise 11

Remove the category column from the DataFrame.

In [17]:
df_no_category = df.drop("categories")
df_no_category.show()

+-----------+------+---------+---+------------+
|customer_id|  name|     city|age|annual_spend|
+-----------+------+---------+---+------------+
|       C001| Arjun|Hyderabad| 25|       45000|
|       C002| Meera|  Chennai| 32|       52000|
|       C003|Rajesh|Bangalore| 29|       61000|
|       C004| Priya|    Delhi| 22|       38000|
|       C005|Sanjay|   Mumbai| 35|       72000|
|       C006| Kavya|Hyderabad| 28|       48000|
|       C007| Imran|    Delhi| 31|       53000|
|       C008| Divya|  Chennai| 27|       45000|
|       C009|  Anil|Bangalore| 40|       85000|
|       C010|  Ritu|   Mumbai| 23|       39000|
|       C011|  Hari|Hyderabad| 33|       56000|
|       C012|  Sana|    Delhi| 26|       47000|
|       C013|Vikram|  Chennai| 38|       91000|
|       C014| Deepa|   Mumbai| 30|       62000|
|       C015|  Asha|Bangalore| 24|       41000|
|       C016| Kiran|    Delhi| 29|       59000|
|       C017| Farah|Hyderabad| 36|       70000|
|       C018| Tarun|  Chennai| 28|       53000|
|       C019| Nisha|   Mumbai| 21|       35000|
|       C020| Yusuf|Bangalore| 34|       76000|
+-----------+------+---------+---+------------+
only showing top 20 rows


Exercise 12

Sort customers by age in descending order.

In [18]:
from pyspark.sql.functions import desc

df.orderBy(desc("age")).show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|
|       C022|  Zara|Hyderabad| 32|       58000|    Grocery|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|
|       C023|  Ajay|  Chennai| 30|       51000|  Furniture|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
+-----------+------+---------+---+------------+-----------+
only showing top 20 rows

Exercise 13

Find customers who are younger than the average age of the entire dataset. Steps:

Calculate average age.

Filter df where age < avg_age.

# Task
Calculate the average age of all customers in the df DataFrame and then filter df to display only those customers whose age is less than this calculated average age.

## Calculate Average Age
Subtask:
Calculate the average age of all customers in the DataFrame using PySpark's avg aggregation function.

Reasoning: To calculate the average age, I need to import the avg function from pyspark.sql.functions, apply it to the 'age' column of the DataFrame, and then extract the numerical result.

In [19]:
from pyspark.sql.functions import avg

avg_age_df = df.select(avg("age"))
avg_age = avg_age_df.collect()[0][0]

print(f"The average age of customers is: {avg_age}")

The average age of customers is: 29.8

In [20]:
df.filter(df.age < avg_age).show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|
|       C026| Swati|    Delhi| 25|       46000|Electronics|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|
|       C030| Leela|    Delhi| 22|       36000|    Grocery|
+-----------+------+---------+---+------------+-----------+

Exercise 14

Display the top 5 highest spending customers.

In [21]:
from pyspark.sql.functions import desc
df.orderBy(desc("annual_spend")).show(5)

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend| categories|
+-----------+------+---------+---+------------+-----------+
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
+-----------+------+---------+---+------------+-----------+
only showing top 5 rows

Exercise 15

Create a new DataFrame containing only customers from Mumbai.

In [22]:
df_mumbai_customers = df.filter(df.city == 'Mumbai')
df_mumbai_customers.show()

+-----------+------+------+---+------------+-----------+
|customer_id|  name|  city|age|annual_spend| categories|
+-----------+------+------+---+------------+-----------+
|       C005|Sanjay|Mumbai| 35|       72000|Electronics|
|       C010|  Ritu|Mumbai| 23|       39000|   Clothing|
|       C014| Deepa|Mumbai| 30|       62000|   Clothing|
|       C019| Nisha|Mumbai| 21|       35000|    Grocery|
|       C025|Gautam|Mumbai| 39|       82000|  Furniture|
+-----------+------+------+---+------------+-----------+

#OPTIONAL BONUS EXERCISES
Bonus Exercise 1

Extract the first letter of each name and store in a new column

In [23]:
from pyspark.sql.functions import col, substring

df_first_letter = df.withColumn("first_letter_name", substring(col("name"), 1, 1))
df_first_letter.show()

+-----------+------+---------+---+------------+-----------+-----------------+
|customer_id|  name|     city|age|annual_spend| categories|first_letter_name|
+-----------+------+---------+---+------------+-----------+-----------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|                A|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|                M|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|                R|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|                P|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|                S|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|                K|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|                I|
|       C008| Divya|  Chennai| 27|       45000|Electronics|                D|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|                A|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|                R|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|                H|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|                S|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|                V|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|                D|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|                A|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|                K|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|                F|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|                T|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|                N|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|                Y|
+-----------+------+---------+---+------------+-----------+-----------------+
only showing top 20 rows

Bonus Exercise 2

Mask the customer_id. Example: C001 → ***01

In [24]:
from pyspark.sql.functions import concat, lit, substring

df_masked_id = df.withColumn(
    "masked_customer_id",
    concat(lit("***"), substring(col("customer_id"), 4, 2))
)
df_masked_id.show()

+-----------+------+---------+---+------------+-----------+------------------+
|customer_id|  name|     city|age|annual_spend| categories|masked_customer_id|
+-----------+------+---------+---+------------+-----------+------------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|              ***1|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|              ***2|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|              ***3|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|              ***4|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|              ***5|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|              ***6|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|              ***7|
|       C008| Divya|  Chennai| 27|       45000|Electronics|              ***8|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|              ***9|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|              ***0|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|              ***1|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|              ***2|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|              ***3|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|              ***4|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|              ***5|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|              ***6|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|              ***7|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|              ***8|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|              ***9|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|              ***0|
+-----------+------+---------+---+------------+-----------+------------------+
only showing top 20 rows

Bonus Exercise 3

Create a new boolean column "is_senior" where age > 35

In [25]:
from pyspark.sql.functions import when, col

df_with_is_senior = df.withColumn(
    "is_senior",
    when(col("age") > 35, True).otherwise(False)
)
df_with_is_senior.show()

+-----------+------+---------+---+------------+-----------+---------+
|customer_id|  name|     city|age|annual_spend| categories|is_senior|
+-----------+------+---------+---+------------+-----------+---------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|    false|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|    false|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|    false|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|    false|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|    false|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|    false|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|    false|
|       C008| Divya|  Chennai| 27|       45000|Electronics|    false|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|     true|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|    false|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|    false|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|    false|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|     true|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|    false|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|    false|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|    false|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     true|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|    false|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|    false|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|    false|
+-----------+------+---------+---+------------+-----------+---------+
only showing top 20 rows

Bonus Exercise 4

Count number of customers per city (uses groupBy).

In [26]:
df.groupBy("city").count().show()

+---------+-----+
|     city|count|
+---------+-----+
|Bangalore|    6|
|  Chennai|    6|
|   Mumbai|    5|
|    Delhi|    7|
|Hyderabad|    6|
+---------+-----+